jluisalegria/PB/EthernetBoard.X/c_i2c_rtcc_mcset_p18f87j11_b06.c
// File Name    : c_i2c_rtcc_mcset_p18f87j11_b06.c 
// RTCC = MC79410, PIC18 family, C language. 
// Dependencies : p18f87j11.h 
// Processor    : PIC18F87J11   
// Hardware     : EVB  =  PIC18 EXPLORER
//                RTCC =  MCP79410  
// I.D.E.       : MPLAB + C18 compiler   
// Company      : Microchip Technology , Inc. 
// Author       : Alexandru Valeanu 
//...........................................................................
//                   SOFTWARE  LICENSE AGREEMENT    
//...........................................................................
// "Microchip Technology Inc." ("Microchip") licenses this software to you 
// solely for use with Microchip's Serial RTCC products.  
// The software is owned by Microchip and/or its licensors, and is protected 
// under applicable copyright laws.  All rights reserved.
// SOFTWARE IS PROVIDED "AS IS."  MICROCHIP AND ITS LICENSOR EXPRESSLY 
// DISCLAIM ANY WARRANTY OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING 
// BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS 
// FOR A PARTICULAR PURPOSE,OR NON-INFRINGEMENT. IN NO EVENT SHALL MICROCHIP 
// AND ITS LICENSORS BE LIABLE FOR ANY INCIDENTAL, SPECIAL, INDIRECT OR 
// CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, HARM TO YOUR EQUIPMENT, 
// COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES, ANY 
// CLAIMS BY THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE 
// THEREOF), ANY CLAIMS FOR INDEMNITY OR CONTRIBUTION, OR OTHER SIMILAR COSTS."
//***************************************************************************
// History      :  V1.0 - Initial Release 
//...........................................................................
// File Description : This is the file for ANxxxx                    
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
//          HARDWARE  SCHEMATIC : EVB = PIC18 EXPLORER  
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ 
//        ___________________      ___________      __________________
//   _--_|          RC3/SCK1 |--->|SCK        |--->|DB0-DB7           |
//  | S1 |RB0  SPI  RC5/SDO1 |--->|SDI        |--->|RS      LCD       |
// _|_   |                   |    |  MCP23S17 |--->|E      LUMIX      |
//       |               RA2 |--->|/CS        |    |                  | 
//       |   PIC18F87J11     |    |___________|    |__________________|
//       |                   |     _______________
//   _--_|RA5       RC4/SDA1 |<-->|SDA RTCC  Vbat |__     S1 = MENU KEY            
//  | S2 |     I2C  RC3/SCL1 |--->|SCL MCP79410   | _|_   S2 = INCR KEY
// _|_   |         RA4/T0CKI |<---|MFP            | --- BAT 
//       |___________________|    |_______________| _|_   (SDA/SCL have pull-ups) 
//                                                        (S1 /S2  have pull-ups)  
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
//    APPLICATION'S  DESCRIPTION (ELECTRONIC WATCH : DISPLAY + SETUP) 
//............................................................................
// The firmware creates a list of drivers usefull to interface 
// the PIC18 Explorer board with MCP79410 I2C RTCC. 
// The presented drivers are: 
// - SPI basic    - SPI expander (MCP23S17) 
// - LCD (LUMIX)  - keyboard (S1 = MENU & S2 = INCREMENT) 
// - I2C basic    - I2C RTCC  - Interrupts based on TMR0(counter input = MFP).
// Moreover, the application displays on the LCD all 6 time/date variables:
// year, month, date, hour, minutes, seconds, using interrupts generated
// by TMR0's overflow, according to MFP which is connected to the counter
// input of TMR0.
// The main function performs the setup of the above variables, using the 
// 2 onboard push-buttons: S1 = MENU KEY ; S2 = INCREMENT KEY.
// The setup menu is entered through the MENU KEY, which stops interrupts.
// Every action on the MENU KEY shifts the setup to the next variable. 
// The LCD cursor points to the variable that must be set. 
// Every action of INCR KEY will increment the related variable. 
// Once the menu is exit(after 'seconds'), interrupts are again enabled and
// the RTCC counts again.    
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
//                         CONFIGURATION  BITS 
//.................................................................................
   #pragma config   FOSC = HSPLL,   FCMEN = OFF, IESO = OFF   // CONFIG1H
   #pragma config  WDTEN = OFF                                // CONFIG2H
   #pragma config  XINST = OFF                                // CONFIG4L 
//.................................................................................
   #include "p18f87j11.h"              
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                    GLOBAL CONSTANTS RTCC - ADDRESSES 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     #define  ADDR_EEPROM_WRITE 0xae       //  DEVICE ADDR for EEPROM (writes)   
     #define  ADDR_EEPROM_READ  0xaf       //  DEVICE ADDR for EEPROM (reads)  
     #define  ADDR_RTCC_WRITE   0xde       //  DEVICE ADDR for RTCC MCHP  (writes) 
     #define  ADDR_RTCC_READ    0xdf       //  DEVICE ADDR for RTCC MCHP  (reads) 
//.................................................................................  
     #define  SRAM_PTR          0x20       //  pointer of the SRAM area (RTCC) 
     #define  ADDR_EEPROM_SR    0xff       //  STATUS REGISTER in the  EEPROM
//.................................................................................
     #define  ADDR_SEC          0x00       //  address of SECONDS      register 
     #define  ADDR_MIN          0x01       //  address of MINUTES      register 
     #define  ADDR_HOUR         0x02       //  address of HOURS        register 
     #define  ADDR_DAY          0x03       //  address of DAY OF WK    register 
     #define  ADDR_STAT         0x03       //  address of STATUS       register 
     #define  ADDR_DATE         0x04       //  address of DATE         register  
     #define  ADDR_MNTH         0x05       //  address of MONTH        register 
     #define  ADDR_YEAR         0x06       //  address of YEAR         register 
     #define  ADDR_CTRL         0x07       //  address of CONTROL      register 
     #define  ADDR_CAL          0x08       //  address of CALIB        register 
     #define  ADDR_ULID         0x09       //  address of UNLOCK ID    register
//.................................................................................
     #define  ADDR_ALM0SEC      0x0a       //  address of ALARMO SEC   register 
     #define  ADDR_ALM0MIN      0x0b       //  address of ALARMO MIN   register 
     #define  ADDR_ALM0HR       0x0c       //  address of ALARMO HOUR  register 
     #define  ADDR_ALM0CTL      0x0d       //  address of ALARM0 CONTR register
     #define  ADDR_ALM0DAT      0x0e       //  address of ALARMO DATE  register 
     #define  ADDR_ALM0MTH      0x0f       //  address of ALARMO MONTH register 
//................................................................................. 
     #define  ADDR_ALM1SEC      0x11       //  address of ALARM1 SEC   register 
     #define  ADDR_ALM1MIN      0x12       //  address of ALARM1 MIN   register 
     #define  ADDR_ALM1HR       0x13       //  address of ALARM1 HOUR  register 
     #define  ADDR_ALM1CTL      0x14       //  address of ALARM1 CONTR register
     #define  ADDR_ALM1DAT      0x15       //  address of ALARM1 DATE  register 
     #define  ADDR_ALM1MTH      0x16       //  address of ALARM1 MONTH register 
//.................................................................................        
     #define  ADDR_SAVtoBAT_MIN 0x18       //  address of T_SAVER MIN(VDD->BAT)
     #define  ADDR_SAVtoBAT_HR  0x19       //  address of T_SAVER HR (VDD->BAT) 
     #define  ADDR_SAVtoBAT_DAT 0x1a       //  address of T_SAVER DAT(VDD->BAT) 
     #define  ADDR_SAVtoBAT_MTH 0x1b       //  address of T_SAVER MTH(VDD->BAT) 
//..................................................................................
     #define  ADDR_SAVtoVDD_MIN 0x1c       //  address of T_SAVER MIN(BAT->VDD)
     #define  ADDR_SAVtoVDD_HR  0x1d       //  address of T_SAVER HR (BAT->VDD) 
     #define  ADDR_SAVtoVDD_DAT 0x1e       //  address of T_SAVER DAT(BAT->VDD) 
     #define  ADDR_SAVtoVDD_MTH 0x1f       //  address of T_SAVER MTH(BAT->VDD)        
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                  GLOBAL CONSTANTS RTCC - INITIALIZATION 
//..................................................................................
     #define  START_32KHZ  0x80            //  start crystal: ST = b7 (ADDR_SEC)
     #define  LP           0x20            //  mask for the leap year bit(MONTH REG)   
     #define  HOUR_12      0x40            //  12 hours format   (ADDR_HOUR)   
     #define  PM           0x20            //  post-meridian bit (ADDR_HOUR) 
     #define  OUT_PIN      0x80            //  = b7 (ADDR_CTRL) 
     #define  SQWE         0x40            //  SQWE = b6 (ADDR_CTRL) 
     #define  ALM_NO       0x00            //  no alarm activated        (ADDR_CTRL) 
     #define  ALM_0        0x10            //  ALARM0 is       activated (ADDR_CTRL)
     #define  ALM_1        0x20            //  ALARM1 is       activated (ADDR_CTRL)
     #define  ALM_01       0x30            //  both alarms are activated (ADDR_CTRL)
     #define  MFP_01H      0x00            //  MFP = SQVAW(01 HERZ)      (ADDR_CTRL)  
     #define  MFP_04K      0x01            //  MFP = SQVAW(04 KHZ)       (ADDR_CTRL)  
     #define  MFP_08K      0x02            //  MFP = SQVAW(08 KHZ)       (ADDR_CTRL)  
     #define  MFP_32K      0x03            //  MFP = SQVAW(32 KHZ)       (ADDR_CTRL)  
     #define  MFP_64H      0x04            //  MFP = SQVAW(64 HERZ)      (ADDR_CTRL)
     #define  ALMx_POL     0x80            //  polarity of MFP on alarm  (ADDR_ALMxCTL)   
     #define  ALMxC_SEC    0x00            //  ALARM compare on SEC      (ADDR_ALMxCTL)              
     #define  ALMxC_MIN    0x10            //  ALARM compare on MIN      (ADDR_ALMxCTL)   
     #define  ALMxC_HR     0x20            //  ALARM compare on HOUR     (ADDR_ALMxCTL)   
     #define  ALMxC_DAY    0x30            //  ALARM compare on DAY      (ADDR_ALMxCTL)   
     #define  ALMxC_DAT    0x40            //  ALARM compare on DATE     (ADDR_ALMxCTL)   
     #define  ALMxC_ALL    0x70            //  ALARM compare on all param(ADDR_ALMxCTL)    
     #define  ALMx_IF      0x08            //  MASK of the ALARM_IF      (ADDR_ALMxCTL)
     #define  OSCON        0x20            //  state of the oscillator(running or not)
     #define  VBATEN       0x08            //  enable battery for back-up         
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                   GLOBAL CONSTANTS LCD (LUMIX - SAMSUNG CONTROLLER)  
//.......................................................................................
     #define N1_ROW        0x00            //  start address of DDRAM / 1 line
     #define N2_ROW1       0x00            //  start address of DDRAM ROW1 / 2 lines 
     #define N2_ROW2       0x40            //  start address of DDRAM ROW2 / 2 lines
//....................................................................................... 
     #define CLEAR         0x01            //  DDRAM=00h, cursor left(row1), I/D=1
     #define HOME          0x02            //  DDRAM=00h, curs orig, display no shift
//.......................................................................................
     #define MODE          0x04            //  entry mode (inc/dec + shift display) 
     #define SHR           0x02            //  mode = shift right 
     #define SHIFT         0x01            //  shift entire display
//....................................................................................... 
     #define DISPLAY       0x08            //  open DISPLAY, CURSOR, BLINK 
     #define D_ON          0x04            //  DISPLAY = ON 
     #define C_ON          0x02            //  CURSOR  = ON 
     #define B_ON          0x01            //  BLINK   = ON 
//.......................................................................................
     #define CD_SHIFT      0x10            //  shift cursor or (display+cursor) 
     #define CD            0x08            //  shift display+cursor 
     #define RSH           0x04            //  right shift
//....................................................................................... 
     #define FUNCTION      0x20            //  function set: data length, lines, fonts 
     #define DL8           0x10            //  data length = 8 bits 
     #define LINES         0x08            //  numer of lines = 1/2 (1 = 2L)
     #define FONTS         0x04            //  type of font  
//.......................................................................................
     #define SET_CGRAM     0x40            //  0x40 + AC5-0 
     #define SET_DDRAM     0x80            //  0x80 + AC6-0
//   All commands need RS=0 ; when RS=1, data will be written into the LCD 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                   GLOBAL CONSTANTS - SPI_DEMUX = MCP23S17
//.......................................................................................
    #define IOCON         0x0a             //  CONTROL REGISTER for SPI expander
    #define DEMUX_ADDR    0x40             //  device addr for the DEMUX (A210=000)
    #define IODIRA        0x00             //  DIR for PORTA (0x00 for OUTPUTS)   
    #define IODIRB        0x01             //  DIR for PORTB (0x00 for OUTPUTS) 
    #define GPIOA         0x12             //  general purpose PORTA                          
    #define GPIOB         0x13             //  general purpose PORTB
    #define OLATA         0x14             //  latch for PORTA  
    #define OLATB         0x15             //  latch for PORTB 
//.......................................................................................
    #define CMND_LCD_DIS  0x00             //  mask sent to PORTA (dis LCD for CMNDs) 
    #define CMND_LCD_EN   0x40             //  mask sent to PORTA (en  LCD for CMNDs)  
    #define DATA_LCD_DIS  0x80             //  mask sent to PORTA (dis LCD for DATA) 
    #define DATA_LCD_EN   0xc0             //  mask sent to PORTA (en  LCD for DATA)
//.......................................................................................
    #define ASCII_DIGIT   0x30             //  ASCII '0' (usefull to display digits) 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                        GLOBAL CONSTANTS - KEYBOARD 
//.......................................................................................
     #define KEYB_MENU 0x01          // code for the MENU KEY (enter,exit,change cursor) 
     #define KEYB_INCR 0x02          // code for the INCR KEY (increments values)    
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                         GLOBAL BIT VARIABLES
//.......................................................................................
     #define  NCS_SPI  PORTAbits.RA2        // /CS for the SPI_DEMUX (MCP23S17)
     #define  KEYB1    PORTBbits.RB0        // switch1 on RB0 
     #define  KEYB2    PORTAbits.RA5        // switch2 on RA5 
     #define  SQVAW    PORTAbits.RA4        // square vawe MFP from RTCC      
     #define  T0_OVFL  INTCONbits.TMR0IF    // Timer0 overflow 
     #define  T0_ON    T0CONbits.TMR0ON     // Timer0 start/stop
     #define T1_OVFL   PIR1bits.TMR1IF      // overflow of TMR1  
     #define T1_ON     T1CONbits.TMR1ON     // start/stop T1 bit
     #define T3_OVFL   PIR2bits.TMR3IF      // Timer3 OVERFLOW 
     #define T3_ON     T3CONbits.TMR3ON     // Timer3 start/stop              
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬ 
//                        GLOBAL  VARIABLES UNINITIALIZED
//.......................................................................................
     #pragma udata   // un-initialized variables
     unsigned char sec, min, hr,day, dat, mon, yr ; // time variables, BCD format
     unsigned char rtcc_buf       ;   // global data buffer for the RTCC
     unsigned char err_cnt = 0x00 ;   // error counter ; slave's I2C_NACK 
     unsigned char err_flg = 0x00 ;   // error flag ; reacts at slave's NACK & MSSP1IF 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                         GLOBAL VARIABLES INITIALIZED
//.......................................................................................
    #pragma romdata const_table                  // constant table in ROM 
    rom const  unsigned char *tim  = "time "   ; // 'time' string  
    rom const  unsigned char *date = "date 20" ; // 'date' string , add millenium  
    #pragma romdata                              // end of the ROM table    
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
//                             FUNCTIONS' PROTOTYPES 
//***************************************************************************************
  void ferror(void)                       ; // fatal error (no ACK from the I2C_slave 
  void spi_wrbyte(unsigned char spi_data) ; // streams out a byte on the SPI bus
  void wrcmnd_lcd(unsigned char cmnd_lcd) ; // writes a command byte to the LCD
  void wrdata_lcd(unsigned char data_lcd) ; // writes a data byte to the LCD
  void wrstr_lcd(const rom unsigned char *str_lcd); // writes a string(message) to the LCD
//.......................................................................................   
  void ini_gpio_led(void)  ;    // init PORTD to display on LEDs 
  void ini_gpio_other(void);    // RA5=S2(input),RB0=S1(input) = onboard switches
                                // RA2=NCS_SPI = /CS for the SPI_DEMUX, RA4 = MFP 
  void ini_tim0(void)      ;    // init Timer0=counter: stop, no prescaler, clear overflow
                                // TMRO is used as counter(counts seconds on MFP signal)
  void ini_tim1(void)      ;    // init Timer1: 16b, no ext osc, int osc, no psc, stop
                                // TMR1 is used to create delays used by the interrupt func
  void ini_tim3(void)      ;    // init Timer3: 16b, int osc, psc=8, stop 
                                // TMR3 is used to create delays in the main function(KEYB) 
  void ini_spi1(void)      ;    // init SPI module on MSSP1 
  void ini_i2c1(void)      ;    // init I2C module on MSSP1
  void stop_mssp1(void)    ;    // stop MSSP1 module (SPI or I2C)   
  void ini_spidemux(void)  ;    // init SPI DEMUX chip (SPI expander)
  void clr_lcd(void)       ;    // clears the LCD   
  void ini_lcd(void)       ;    // init the LCD module (LUMIX)
//.......................................................................................
  void dlt1(unsigned int steps);// basic delay in steps(100 nsec) based on T1 
                                // for a 10Mhz bus speed    : max_delay = 06.55 ms
  void dlt3(unsigned int steps);// 10Mhz:8=1.25Mhz(0.8usec) : max_delay = 52.43 ms   
  void dly1_5ms(void) ;         // used in some LCD commands (TMR1)
  void dly39us(void)  ;         // used in some LCD commands (TMR1)
  void dly43us(void)  ;         // used in some LCD commands (TMR1)          
  void dly5ms(void)   ;         // write cycle time through delays, instead polling(EEPROM)
  void dly100ms(void) ;         // used in keyboards functions      (TMR3) 
  void dly1s(void)    ;         // 1       second delay = 4 * 250ms (TMR3) 
//......................................................................................
  void poll_if_tim1(void);      // timeout for MSSP1IF, in case of removing the PICTAIL
  void i2c_start(void)  ;       // I2C   START command
  void i2c_restart(void);       // I2C RESTART command (for reads) 
  void i2c_stop(void)   ;       // I2C    STOP command 
  void i2c_wr(unsigned char i2c_data); // I2C WRITE BYTE
  void i2c_rd(void)     ;       // I2C READ BYTE (returns 'rtcc_buf') 
  void i2c_ack(void)    ;       // MASTER ACK 
  void i2c_nack(void)   ;       // MASTER NOACK        
  void ini_rtcc(void)   ;       // initialization of the RTCC. (MCP79410)
  void ini_time(void)   ;       // initialize time/date variables 
  void rtcc_wr(unsigned char time_var, unsigned char rtcc_reg) ; 
                                // writes a byte from 'time_var' in a RTCC register  
 unsigned char rtcc_rd(unsigned char rtcc_reg) ;  
                                // results of reads are temporary stored in 'rtcc_buf' 
//.....................................................................................
// Functions to display time variables on the LCD are specific for every
// time variable, because of specific masks in RTCCs registers. 
// Below functions will convert a double BCD byte in 2 ASCII bytes.
   void sec_to_lcd(void) ;      // displays SECONDS   
   void min_to_lcd(void) ;      // displays MINUTES 
   void  hr_to_lcd(void) ;      // displays HOURS 
   void dat_to_lcd(void) ;      // displays DATE 
   void mon_to_lcd(void) ;      // displays MONTH 
   void  yr_to_lcd(void) ;      // displays YEAR
//..................................................................................
   unsigned char keyb_press(void)   ;  // waits a key (if not, loops for ever) 
                                       // returns 2 codes : MENU KEY / INCR KEY
   void back_lcd(unsigned char pos) ;  // returns back cursor with 'pos' positions(LCD)
   void del_lcd(unsigned char pos)  ;  // deletes back 'pos' positions(LCD)   
   void incr_yr(void)               ;  // increments 'year'    variable (watch setup)   
   void incr_mon(void)              ;  // increments 'month'   variable (watch setup) 
   void incr_dat(void)              ;  // increments 'date'    variable (watch setup) 
   void incr_hr(void)               ;  // increments 'hour'    variable (watch setup) 
   void incr_min(void)              ;  // increments 'minute'  variable (watch setup) 
   void incr_sec(void)              ;  // increments 'seconds' variable (watch setup) 
//.......................................................................................
   void display_time(void)          ;  // displays time variables, when the MENU is not 
                                       // entered.(in the interrupt function) 
//.......................................................................................
   void ini_intr(void)              ;  // initialize  interrupts (on TMR0) 
   void start_intr(void)            ;  // enable      interrupts (on TMR0) 
   void stop_intr(void)             ;  // disable     interrupts (on TMR0) 
   void InterruptServiceHigh(void)  ;  // declare the interrupt service routine 
   #pragma code InterruptVectorHigh = 0x08 // declare InterruptVector, high priority(TMR0)
   void InterruptVectorHigh(void) 
   { _asm 
     goto InterruptServiceHigh         // jump to the interrupt routine     
    _endasm }                                                  
//**************************************************************************************
//                         FUNCTIONS' DEFINITIONS 
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
