jluisalegria/PB/EthernetBoard.X/c_i2c_rtcc_mcset_p18f87j11_b06.c
     void ferror(void)        // fatal error (used on I2C_NOACK from the slave)
   {  err_flg = 0x01    ;     // if error, set error flag (NOACK from slave) 
      LATD = err_cnt ;  }     // LEDs = error counter     
//......................................................................................
//                     LOW LEVEL INITIALIZATION FUNCTIONS 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                      GPIOs : LEDs + SWITCHES 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    void ini_gpio_led(void)  
  { TRISD = 0x00 ; LATD = 0x00 ; }   // PORTD = OUT, LEDs = OFF  
//.......................................................................................
   void ini_gpio_other(void) // RA5=S2(input),RB0=S1(input) = onboard switches
                             // RA2=NCS_SPI = /CS for the SPI_DEMUX, RA4 = MFP(TMR0 input)  
   { TRISB = 0xff         ;  // RB0=S1 = input ( all inputs ) 
     WDTCONbits.ADSHR = 1 ;  // switch to the alternate bank of SFRs 
     ANCON0 = 0x1f        ;  // AN4 - AN0 = digital inputs (PORTA) 
     WDTCONbits.ADSHR = 0 ;  // switch to the default   bank of SFRs 
     TRISA = 0xfb         ;  // RA2 = OUT = NCS_SPI ; all other pins = IN 
     NCS_SPI = 1      ;   }  // rise-up the chip_select signal(SPI DEMUX chip)
//................................................................................
   void ini_tim0(void)       // TMR0 initialization 
   { T0CON = 0x28     ;      // TMR0 stopped, prescaler by-passed, T0=counter   
     T0_OVFL = 0      ;  }   // clear overflow flag
//................................................................................
   void ini_tim1(void)       // TMR1 initialization 
   { T1CON   = 0xc0   ;      // 16b, no ext osc, internal osc, no psc, stop timer 
     T1_OVFL = 0      ;  }   // clear overflow flag ; used for delays in interrupts 
//................................................................................
   void ini_tim3(void)       // TMR3 initialization 
  { T3CON   = 0xb0      ;    // 16b, internal osc, psc=8, stop timer 
    T3_OVFL = 0     ;   }    // clear overflow flag 
//................................................................................
   void ini_spi1(void)      // init the SPI module on MSSP1
   { TRISC = 0xd7    ;      // C4 = SDI1 = SDA1 = in
                            // C5 = SDO1 = out,   C3 = SCK1 = SCL1 = out 
     SSP1STAT = 0x40 ;      // CKE = 1          ; CK=iddle_low, shift on CK+
     SSP1CON1 = 0x22 ;   }  // CKP = 0, FOSC/64 ; see the SPI_expander's datasheet
//..................................................................................                                             
   void ini_i2c1(void)      // init the I2C module on MSSP1
   { TRISC    = 0xff  ;     // all inputs ; SDA & SCL = inputs 
                            // TRISC=0xdf/d8 ; SCL=C3 , SDA=C4 = IN ; SDO(SPI)=C5=OUT 
//   SSP1ADD  = 0x63  ;     // baud rate = 100 khz ; 10mhz:100 = 100 khz
     SSP1ADD  = 0xc7  ;     // baud rate =  50 khz   
     SSP1STAT = 0x80  ;     // slew rate dis, SMBUS disabled  
     SSP1CON1 = 0x28  ;     // enable module, I2C master SSP1ADD=baud rate
     SSP1CON2 = 0x00  ;  }  // clear all control bits                       
//..................................................................................
   void stop_mssp1(void) 
{ SSP1CON1bits.SSPEN = 0 ; }// disable MSSP1 module                             
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
//                        TIMER BASED DELAY FUNCTIONS
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   void dlt1(unsigned int steps)   // delay based on TMR1 (used in the interrupt func)
                                   // basic delay in steps(100 nsec) ; see osc set
                                   // for a 10Mhz bus speed : max_delay = 6.55ms 
 {                                 // load the 16b delay value ( in steps ) 
      TMR1H = ~(steps/256)&0xff;   // first MSB (complement, because timer1++) 
      TMR1L = ~(steps%256)&0xff;   //       LSB (complement, because timer1++)   
      T1_ON = 1             ;      // start counter : bus_ck = 10 Mhz, no prescaler  
  while(!T1_OVFL)           ;      // wait T1_OVFL to rise-up 
      T1_ON = 0             ;      // stop CNT (no ck for the timer)
      T1_OVFL = 0           ;  }   // clear overflow flag  
//...............................................................................
   void dlt3(unsigned int steps)   // delay based on TMR3 ; used in the main function
                                   // basic delay in steps(800 nsec) ; see osc set
                                   // for a 10Mhz bus speed : max_delay = 52.43 msec  
 {                                 // load the 16b delay value ( in steps ) 
      TMR3H = ~(steps/256)&0xff;   // first MSB (complement, because timer3++) 
      TMR3L = ~(steps%256)&0xff;   //       LSB (complement, because timer3++)    
      T3_ON = 1             ;      // start counter : bus_ck = 10 Mhz, psc = 8  
  while(!T3_OVFL)           ;      // wait T3_OVFL to rise-up
      T3_ON = 0             ;      // stop CNT (no ck for the timer)
      T3_OVFL = 0           ;  }   // clear overflow flag  
//...............................................................................
 void dly1_5ms(void)               // 1.5 msec delay, based on TMR1
{   dlt1(15300)     ;      }       //  delay used in some LCD commands 
//...............................................................................
 void dly39us(void)                // 39 usec   delay, based on TMR1 
{   dlt1(390)       ;      }       //  delay used in some LCD commands 
//...............................................................................
 void dly43us(void)                // 43 usec   delay, based on TMR1  
{   dlt1(430)       ;      }       // delay used in some LCD commands 
//...............................................................................
 void dly5ms(void)                 // write cycle time through delays,(for EEPROM)
{ dlt3(6250)             ;   }     // instead of polling. Mainly, used in this app 
                                   // to create long delays : 100ms, 1 sec. (TMR3)  
//...............................................................................
 void dly100ms(void)               // 100 msec delay, based on TMR3 
{ unsigned char k = 20    ;        //  20 x 5 msec = 100 msec 
  while(--k) { dly5ms() ; }  }     //  used in keyb functions, to avoid hazard   
//...............................................................................
 void dly1s(void)                  //  1 sec delay, based on TMR3 
{ unsigned int k = 200    ;        //  200 x 5 msec = 1 sec 
  while(--k) { dly5ms()   ; } }    //  used in messages displayed on LEDs . 
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
//                     BASIC COMMUNICATION FUNCTIONS 
//................................................................................
   void spi_wrbyte(unsigned char spi_data) // writes a byte on the SPI bus (for LCD)
 { SSP1BUF = spi_data       ;          // load data buffer 
   while(!PIR1bits.SSP1IF)  ;          // poll the SPI interrupt flag 
   PIR1bits.SSP1IF = 0      ;    }     // clear the flag after end of transmission                              
//................................................................................ 
   void wrcmnd_lcd(unsigned char cmnd_lcd)  // WRITES A COMMAND BYTE IN THE LCD 
 { NCS_SPI = 0                    ;    // assert /CS of the SPI_DEMUX chip
   spi_wrbyte(DEMUX_ADDR)         ;    // send on the line the device address(DEMUX)
   spi_wrbyte(GPIOB)              ;    // write the address of PORTB 
   spi_wrbyte(cmnd_lcd)           ;    // send to PORTB the desired command 
   NCS_SPI = 1                    ;    // end command byte transmission 
                                       // PORTB = command for the LCD 
                                       // need to write it in the LCD through 
                                       // RS & EN signals on PORTA
   dly39us()                      ;    // short delay between NCS pulses 
   NCS_SPI = 0                    ;    // assert /CS of the SPI_DEMUX chip 
   spi_wrbyte(DEMUX_ADDR)         ;    // send on the line the device address(DEMUX)
   spi_wrbyte(GPIOA)              ;    // write the address of PORTA
   spi_wrbyte(CMND_LCD_EN)        ;    // enable  command writes in LCD(RS=0;EN=1)
   NCS_SPI = 1                    ;    // end command transmission 
   dly39us()                      ;    // short delay between commands 
   NCS_SPI = 0                    ;    // activate /CS signal of the SPI expander 
   spi_wrbyte(DEMUX_ADDR)         ;    // launch the device address (SPI EXPANDER) 
   spi_wrbyte(GPIOA)              ;    // send PORTA's address 
   spi_wrbyte(CMND_LCD_DIS)       ;    // disable writes command for the LCD(RS=0;EN=0)
   NCS_SPI = 1                    ;    // end spi writes 
   dly39us()                  ;   }    // short delay after command  
//....................................................................................
  void wrdata_lcd(unsigned char data_lcd)  // WRITES A DATA BYTE IN THE LCD 
 { NCS_SPI = 0                    ;    // assert /CS of the SPI_DEMUX chip
   spi_wrbyte(DEMUX_ADDR)         ;    // send on the line de device address(DEMUX)
   spi_wrbyte(GPIOB)              ;    // write the address of PORTB 
   spi_wrbyte(data_lcd)           ;    // send to PORTB the desired data byte 
   NCS_SPI = 1                    ;    // end data byte transmission 
                                       // PORTB = data byte for the LCD 
                                       // need to write it in the LCD through 
                                       // RS & EN signals on PORTA 
   dly39us()                      ;    // short delay between NCS_SPI pulses
   NCS_SPI = 0                    ;    // assert /CS of the SPI_DEMUX chip 
   spi_wrbyte(DEMUX_ADDR)         ;    // send on the line the device address(DEMUX)
   spi_wrbyte(GPIOA)              ;    // write the address of PORTA
   spi_wrbyte(DATA_LCD_EN)        ;    // enable  data writes in LCD(RS=0;EN=1)
   NCS_SPI = 1                    ;    // end enable command 
   dly39us()                      ;    // short delay between writes 
   NCS_SPI = 0                    ;    // activate again /CS of the SPI expander 
   spi_wrbyte(DEMUX_ADDR)         ;    // launch the device address 
   spi_wrbyte(GPIOA)              ;    // send PORTA address 
   spi_wrbyte(DATA_LCD_DIS)       ;    // disable data writes in LCD(RS=0;EN=0)
   NCS_SPI = 1                    ;    // stop data writes  
   dly43us()                  ;   }    // short delay after data writes, end writes     
//..................................................................................
 void wrstr_lcd(const rom unsigned char *str_lcd)// writes a string(message) in the LCD
  {unsigned char k = 0            ;    // char counter 
   while(str_lcd[k]!='\0')             // till the end of the string  
  {wrdata_lcd(str_lcd[k]) ; k++ ; } }  // launch string's char (includes 43us delay)  
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ 
//         HIGH LEVEL INITIALIZATION FUNCTIONS (SPI DEMUX & LCD) 
//.................................................................................
  void ini_spidemux(void)          // init the SPI EXPANDER chip 
  { NCS_SPI = 0             ;      // activate /CS of the SPI expander 
    spi_wrbyte(DEMUX_ADDR)  ;      // write DEMUX  address 
    spi_wrbyte(IODIRA)      ;      // write IODIRA address (direction reg for PORTA)  
    spi_wrbyte(0x00)        ;      // GPIOA = OUT 
    NCS_SPI = 1             ;      // end IODIRA writes 
    dly39us()               ;      // short delay between NCS pulses 
    NCS_SPI = 0             ;      // start IODIRB programming 
    spi_wrbyte(DEMUX_ADDR)  ;      // send SPI EXPANDER address 
    spi_wrbyte(IODIRB)      ;      // send IODIRB address (direction register for PORTB) 
    spi_wrbyte(0x00)        ;      // GPIOB = OUT 
    NCS_SPI = 1             ;      // end IODIRB writes 
    dly39us()               ;      // short delay between commands 
    NCS_SPI = 0             ;      // start GPIOA programming   
    spi_wrbyte(DEMUX_ADDR)  ;      // write DEMUX  address 
    spi_wrbyte(GPIOA)       ;      // write GPIOA address 
    spi_wrbyte(0x00)        ;      // GPIOA = 00h  
    NCS_SPI = 1             ;      // end GPIOA writes 
    dly39us()               ;      // short delay between NCS pulses 
    NCS_SPI = 0             ;      // start GPIOB programming 
    spi_wrbyte(DEMUX_ADDR)  ;      // send DEMUX address 
    spi_wrbyte(GPIOB)       ;      // send GPIOB address 
    spi_wrbyte(0x00)        ;      // GPIOB = 00h 
    NCS_SPI = 1             ;      // end GPIOB writes 
    dly39us()           ;   }      // short delay at the end of the command 
//...............................................................................
  void clr_lcd(void)               // clears the LCD, cursor left up corner
                                   // first row, DDRAM_ADDR = 00    
  { wrcmnd_lcd(CLEAR)       ;      // launch CLEAR command
    dly1_5ms()              ;   }  // long delay after CLEAR command 
//...............................................................................        
  void ini_lcd(void)                     // LCDs initialization 
  { clr_lcd()                          ; // clear LCD (CLEAR command)   
  wrcmnd_lcd(FUNCTION+DL8+LINES)       ; // 8bits, 2 lines  
  wrcmnd_lcd(MODE+SHR)                 ; // shift right cursor MODE 
  wrcmnd_lcd(DISPLAY+D_ON+C_ON+B_ON) ; } // display,cursor,blink=ON                                 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                       I2C DRIVERS 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  void poll_if_tim1(void) {            // poll 2 flags: MSSP1IF & T1
  TMR1H = ~(10000/256)&0xff ; 
  TMR1L = ~(10000%256)&0xff ;          //  1msec delay 
  T1_ON = 1 ;                          //  start timer1
  while(!(PIR1bits.SSP1IF|T1_OVFL)) ;  // wait at least on flag to rise
  if (T1_OVFL) { err_flg = 0x01 ; }    // if timeout, set error flag 
  PIR1bits.SSP1IF = 0  ;               // in any case, clear all   
  T1_OVFL=0 ; T1_ON=0  ;          }    // necessary flags 
//................................................................................
  void i2c_start(void)             // START I2C communication 
  { SSP1CON2bits.SEN = 1    ;      // START bit (cleared by hw in the end) 
    poll_if_tim1()    ;     }      // poll MSSP1IF with 1msec timeout                                                                   
//.................................................................................                              
  void i2c_restart(void)           // RESTART I2C communication (change to 'reads') 
  { SSP1CON2bits.RSEN = 1   ;      // REPEATED START bit (cleared by hw in the end) 
    poll_if_tim1()    ;     }      // poll MSSP1IF with 1msec timeout                               
//.................................................................................                              
  void i2c_stop(void)              // STOP I2C communication 
  { SSP1CON2bits.PEN = 1    ;      // STOP bit (cleared by hw in the end) 
    poll_if_tim1()    ;     }      // poll MSSP1IF with 1msec timeout   
//..................................................................................                              
  void i2c_wr(unsigned char i2c_data) // writes a byte in the I2C SLAVE 
  { SSP1BUF = i2c_data      ;      // load char in data buffer ; start streaming
    poll_if_tim1()    ;            // poll MSSP1IF with 1msec timeout  
    if(SSP1CON2bits.ACKSTAT)       // if NOACK from slave  
    { ferror() ;  }                // call 'fatal error' function
    else {;}                }      // if a correct ACK from the slave, do nothing
//.................................................................................                              
  void i2c_rd(void)                // reads a byte on I2C bus ; returns 'rtcc_buf'  
  { SSP1CON2bits.RCEN = 1   ;      // enable I2C receive mode(RCEN=0 after 8cks by hw)
    poll_if_tim1()    ;            // poll MSSP1IF with 1msec timeout 
    rtcc_buf = SSP1BUF      ;  }   // store read result in the related buffer     
//..................................................................................                           
  void i2c_ack(void)               // ACK=0 from MASTER 
  { SSP1CON2bits.ACKDT = 0  ;      // set the MASTER ACK bit 
    SSP1CON2bits.ACKEN = 1  ;      // enable MASTER ACK sequence  
    poll_if_tim1()    ;     }      // poll MSSP1IF with 1msec timeout 
//...................................................................................                           
  void i2c_nack(void)              // NACK=1 from MASTER 
  { SSP1CON2bits.ACKDT = 1  ;      // set the MASTER NOACK bit  
    SSP1CON2bits.ACKEN = 1  ;      // enable MASTER ACK sequence 
    poll_if_tim1()     ;    }      // poll MSSP1IF with 1msec timeout 
//************************************************************************************
//                      I2C RTCC DRIVERS 
//************************************************************************************
  void rtcc_wr(unsigned char time_var, unsigned char rtcc_reg) 
                              // writes a constant/variable in a RTCC register 
 { i2c_start()             ;  // start I2C communication   
   err_cnt = 0x01          ;  // set error variable = 01
   i2c_wr(ADDR_RTCC_WRITE) ;  // write DEVICE ADDR for RTCC WRITES
   err_cnt = 0x02          ;  // set error variable = 02  
   i2c_wr(rtcc_reg)        ;  // write the register's ADDRESS
   err_cnt = 0x03          ;  // set error variable = 03 
   i2c_wr(time_var)        ;  // write byte variable in the register 
   i2c_stop()              ;  // stop I2C communication
   dly39us()        ;      }  // free time STOP - START         
//.....................................................................................                       
 unsigned char rtcc_rd(unsigned char rtcc_reg)  // reads a register of the RTCC   
 { i2c_start()             ;  // start I2C communication
   err_cnt = 0x04          ;  // set error variable = 04 
   i2c_wr(ADDR_RTCC_WRITE) ;  // write DEVICE ADDR for RTCC WRITES
   err_cnt = 0x05          ;  // set error variable = 05  
   i2c_wr(rtcc_reg)        ;  // write the register ADDRESS 
   i2c_restart()           ;  // RESTART for READS 
   err_cnt = 0x06          ;  // set error variable = 06 
   i2c_wr(ADDR_RTCC_READ)  ;  // send the DEVICE ADDRESS for RTCC READS.
   i2c_rd()                ;  // read register (stored in 'rtcc_buf')
   i2c_nack()              ;  // NOACK from MASTER (last read byte)
   i2c_stop()              ;  // stop I2C communication
   dly39us()               ;  // free time STOP - START 
   return rtcc_buf    ;    }  // store the read byte in 'time_var'                                      
//...................................................................................                              
   void ini_rtcc(void)                  // initialization of the RTCC(MCP79410) 
 {                                      // START bit is located in the sec register   
  day = rtcc_rd(ADDR_DAY)   ;           // read day + OSCON bit 
                                        // keep the previous value of 'seconds'  
rtcc_wr(SQWE+ALM_NO+MFP_01H,ADDR_CTRL); // square vawe on MFP, no alarms, MFP = 1Hz 
                                        // write this init constant in CONTROL REG 
                                        // final settings are: // crystal = started,
                                        // 24H format,square vawe on MFP,no alarms, MFP=1Hz
rtcc_wr(day|VBATEN,ADDR_DAY) ;   }      // enable the battery back-up 
 //.........................................................................................                            
    void ini_time(void)              // initialization of time/date:2010_03_01 , 9am.
  {                                  // it initializes also :24H format, and START OSC.
    if((day&OSCON)==OSCON) {;}       // if oscillator = already running, do nothing. 
    else {                           // if oscillator = not running, set time/date(arbitrary)
                                     // and SART oscillator/ crystal    
    rtcc_wr(0x10,ADDR_YEAR)    ;     // initialize YEAR  register           
    rtcc_wr(0x03,ADDR_MNTH)    ;     // initialize MONTH register  
    rtcc_wr(0x01,ADDR_DATE)    ;     // initialize DATE  register  
    rtcc_wr(0x09,ADDR_HOUR)    ;     // initialize HOUR  register  
    rtcc_wr(0x00,ADDR_MIN)     ;     // initialize MIN   register  
    rtcc_wr(0x30|START_32KHZ,ADDR_SEC) ; }  //init SEC   register, set START bit 
                                      }                                   
//.......................................................................................
//                LCD HIGH LEVEL FUNCTIONS 
//.......................................................................................                         
   void sec_to_lcd(void)                // displays SECONDS
 { wrdata_lcd(((sec&(~START_32KHZ))>>4)+ASCII_DIGIT) ; 
                                        // mask the START bit, extract MS digit by shifting
                                        // right 4 times,  add the ASCII digit offset
   wrdata_lcd((sec&0x0f)+ASCII_DIGIT);} // extract LS digit, add offset    
//.......................................................................................                                         
   void min_to_lcd(void)                // displays MINUTES
 { wrdata_lcd((min>>4)+ASCII_DIGIT)  ;  // extract MS digit for minutes  
                                        // minutes have no control bits, no mask needed 
   wrdata_lcd((min&0x0f)+ASCII_DIGIT);} // extract LS digit for minutes                    
 //.......................................................................................
   void  hr_to_lcd(void)                // displays HOURS
 { wrdata_lcd(((hr&(~HOUR_12))>>4)+ASCII_DIGIT) ; // mask the 12 hours format,
                                                  //extract MS digit by shifting right 4 times 
                                                  // add the ASCII digit offset
   wrdata_lcd((hr&0x0f)+ASCII_DIGIT) ; }          // extract LS digit, add offset           
 //.......................................................................................
   void dat_to_lcd(void)                          // displays DATE
  { wrdata_lcd(((dat&0x3f)>>4)+ASCII_DIGIT) ;     // extract MS digit by shifting
                                                  // right 4 times, add ASCII offset 
    wrdata_lcd((dat&0x0f)+ASCII_DIGIT) ; }        // extract LS digit, add offset       
//........................................................................................                                           
   void mon_to_lcd(void)                          // displays MONTH
  { wrdata_lcd(((mon&0x1f)>>4)+ASCII_DIGIT) ;     // mask leap year, extract MS digit
                                                  // by shifting right 4 times 
