jluisalegria/PB/EthernetBoard.X/c_i2c_rtcc_mcset_p18f87j11_b06.c
                                                  // add  the ASCII digit offset 
    wrdata_lcd((mon&0x0f)+ASCII_DIGIT) ; }        // extract LS digit, add offset  
//.........................................................................................
   void  yr_to_lcd(void)                      // displays YEAR      
   { wrdata_lcd((yr>>4)+ASCII_DIGIT)     ;    // extract MS digit by shifting right 4 times,
                                              // add ASCII offset 
    wrdata_lcd((yr&0x0f)+ASCII_DIGIT) ;  }    // extract LS digit, add ASCII offset       
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                      KEYBOARD FUNCTION 
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   unsigned char keyb_press(void)     // basic keyboard function 
   { unsigned char keyb_code = 0x00 ; // init keyboard code returned by the function    
   while(KEYB1&&KEYB2)              ; // wait a keyboard action(if not, loop) 
   if(!KEYB1){keyb_code=KEYB_MENU ; } // if MENU KEY = pressed, update keyb code = 01  
   else{ keyb_code = KEYB_INCR    ; } // if INCR KEY : code = 02 
         dly100ms() ; dly100ms()  ;   // override keyboard hazard 
   while((!KEYB1)||(!KEYB2))      ;   // wait end of action 
     return keyb_code         ;     } // returns the code only if a key was pressed
                                      // and thereafter, released. 
//........................................................................................
//                  SECONDARY LCD FUNCTIONS 
//.......................................................................................
   void back_lcd(unsigned char pos)    // turns back cursor with 'pos' positions 
   { unsigned char k = 0            ;  // loop counter 
     while(k<pos)                      // for 'pos' positions
   { wrcmnd_lcd(CD_SHIFT) ; k++ ; } }  // shift left cursor, AC-1, increment loop counter    
//........................................................................................
   void del_lcd(unsigned char pos)     // deletes back 'pos' characters  
   { unsigned char k = 0           ;   // loop counter 
     wrcmnd_lcd(DISPLAY+D_ON+B_ON) ;   // CURSOR OFF , delay after command  
     while(k<pos)                      // for 'pos' positions
   { wrcmnd_lcd(CD_SHIFT) ; k++ ;  }   // shift left cursor, AC-1, counter++
     k = 0                         ; 
     while(k<pos) 
     { wrdata_lcd(' ') ; k++  ;    }   // delete 'pos' characters  
     k = 0                         ; 
      while(k<pos)                     // for 'pos' positions
   { wrcmnd_lcd(CD_SHIFT) ; k++ ;  }   // shift left cursor, AC-1, counter++
 wrcmnd_lcd(DISPLAY+D_ON+C_ON+B_ON); } // light again the cursor  
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//                INCREMENT TIME/DATE VARIABLES
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   void incr_yr(void)                // increments YEARS value (2 digits)
                                     // 99-->00 , yy-->y(y+1) , y9-->(y+1)0  
   { if(yr==0x99) { yr = 0x00 ; }    // 99-->00  
     else if ((yr&0x0f)==0x09)       // y9-->(y+1)0    
          { yr=(yr+16)&0xf0 ; }  
          else { yr++       ; }      // yy-->y(y+1)
     yr_to_lcd(); back_lcd(2) ; }    // display year value; turn back cursor, 2 positions
//.......................................................................................
   void incr_mon(void)               // increments MONTHS value 
   { switch(mon) {                   // LP bit was already masked at reads(display_time())
     case 0x09: {mon=0x10;break;}    // 09 --> 10  
     case 0x12: {mon=0x01;break;}    // 12 --> 01 
       default: {mon++   ;break;} }  // in any other case, increment MONTH 
     mon_to_lcd() ; back_lcd(2) ; }  // display month value, turn back cursor 2 positions 
//.......................................................................................
   void incr_dat(void)               // increments DATE  
   { switch(dat) {                   // DATE has no auxiliary flags  
     case 0x31: {dat = 0x01;break;}  // overflow after 31 days 
     case 0x09: {dat = 0x10;break;}  // 09 --> 10 (decimal) 
     case 0x19: {dat = 0x20;break;}  // 19 --> 20 (decimal) 
     case 0x29: {dat = 0x30;break;}  // 29 --> 30 )decimal) 
     default:   {dat++;     break;}} // if no decimal overflow, incr DATE 
     dat_to_lcd()  ; back_lcd(2) ; } // display date value, turn back cursor 2 positions  
//.......................................................................................
   void incr_hr(void)                // increments HOURS value 
   { switch(hr) {                    // none auxiliary control/status bits
     case 0x23: {hr = 0x00;break;}   // '24h' format, overflow after '23'
     case 0x19: {hr = 0x20;break;}   // 19 --> 20 
     case 0x09: {hr = 0x10;break;}   // 09 --> 10 
     default:   {hr++;     break;} } // in any other case, increment value
     hr_to_lcd()  ; back_lcd(2) ;  } // display date value 
//........................................................................................
   void incr_min(void)               // increments MINUTES ('minutes' have no aux flags)  
   { if(min == 0x59)  {min=0x00;}    // overflow after 59 minutes
     else if ((min&0x0f)==0x09)      // m9 --> (m+1)0 
          { min = (min+16)&0xf0 ; }  
          else { min++ ; }           // mm --> m(m+1) 
     min_to_lcd() ; back_lcd(2) ; }  // display new MINUTES value    
//.............................................................................                
  void incr_sec(void)                // increments SECONDS ; bit7 = ST = 1 
  { sec = sec & (~START_32KHZ)    ;  // clear START bit, to simplify increment ops 
    if(sec == 0x59)  {sec=0x00;}     // overflow after 59 seconds 
     else if ((sec&0x0f)==0x09)      // s9 --> (s+1)0 
          { sec = (sec+16)&0xf0 ; }  
          else { sec++ ; }           // ss --> s(s+1)  
    sec_to_lcd() ;  back_lcd(2) ; }  // display new SECONDS value    
//.................................................................................. 
    void display_time(void)          // DISPLAYS ALL TIME VARIABLES : 
                                     // YEAR, MONTH, DATE, HOUR, MINUTES, SECONDS 
    {  stop_mssp1()          ;       // stop MSSP1 module 
       ini_i2c1()            ;       // init I2C1  module to read RTCC 
    yr  = rtcc_rd(ADDR_YEAR) ;       // read YEAR        
    if(err_flg)                      // if error, leave fast the interrupt routine
  { stop_mssp1() ; ini_spi1();       // stop MSSP, init SPI1 module for LCD access
    return ; }                       // break function, return from interrupt 
    mon = rtcc_rd(ADDR_MNTH) ;       // read MONTH 
    if(err_flg)                      // if error, leave fast the interrupt routine
  { stop_mssp1() ; ini_spi1();       // stop MSSP, init SPI1 module for LCD access
    return ; }                       // break function, return from interrupt 
    mon = mon & (~LP)        ;       // mask the leap year bit 
    dat = rtcc_rd(ADDR_DATE) ;       // read DATE 
    if(err_flg)                      // if error, leave fast the interrupt routine
  { stop_mssp1() ; ini_spi1();       // stop MSSP, init SPI1 module for LCD access
    return ; }                       // break function, return from interrupt 
    hr  = rtcc_rd(ADDR_HOUR) ;       // read HOUR
    if(err_flg)                      // if error, leave fast the interrupt routine
  { stop_mssp1() ; ini_spi1();       // stop MSSP, init SPI1 module for LCD access
    return ; }                       // break function, return from interrupt 
    min = rtcc_rd(ADDR_MIN)  ;       // read MIN
    if(err_flg)                      // if error, leave fast the interrupt routine
  { stop_mssp1() ; ini_spi1();       // stop MSSP, init SPI1 module for LCD access
    return ; }                       // break function, return from interrupt 
    sec = rtcc_rd(ADDR_SEC)  ;       // read SEC ; once finished the RTCC's READ
    if(err_flg)                      // if error, leave fast the interrupt routine
  { stop_mssp1() ; ini_spi1();       // stop MSSP, init SPI1 module for LCD access
    return ; }                       // break function, return from interrupt 
    stop_mssp1() ; ini_spi1();       // stop MSSP, init SPI1 module for LCD access 
wrcmnd_lcd(SET_DDRAM+N2_ROW1+07) ;   // set YEAR position on the first row     
yr_to_lcd()  ;  wrdata_lcd(' ')  ;   // display YEAR  + separator    
mon_to_lcd() ;  wrdata_lcd(' ')  ;   // display MONTH + separator  
dat_to_lcd() ;                       // display DATE
wrcmnd_lcd(SET_DDRAM+N2_ROW2+07) ;   // set HOUR position on the second row   
hr_to_lcd()  ;  wrdata_lcd(' ')  ;   // display HOUR  + separator          
min_to_lcd() ;  wrdata_lcd(' ')  ;   // display MIN   + separator    
sec_to_lcd()                ;    }   // display SECONDS, end of DISPLAY function 
//....................................................................................
//                  INTERRUPT  FUNCTIONS 
//....................................................................................
   void ini_intr(void)               // initialization of the Interrupt system 
 { RCONbits.IPEN  = 1       ;        // enable priority mechanism 
   INTCON2bits.TMR0IP = 1   ;        // set TMR0 interrupt priority = high 
   INTCON = 0x80          ; }        // GIEH = 1 , TMR0IE = 0(disable TMR0 intr) 
   
   void stop_intr(void)              // disable interrupts (based on TMR0) 
 { INTCONbits.TMR0IE = 0  ; }        // disable TMR0 interrupts 

