jluisalegria/PB/EthernetBoard.X/c_i2c_rtcc_mcset_p18f87j11_b06.c
   void start_intr(void)             // enable interrupts (based on TMR0) 
 { INTCONbits.TMR0IE = 1  ; }        // enable TMR0 interrupts 

   #pragma interrupt InterruptServiceHigh // displays once/second : time/date 
    void InterruptServiceHigh(void)  // Interrupts Service Routine  
   { TMR0H = 0xff ; TMR0L = 0xff ;   // load again the time values in TMR0 
     T0_OVFL = 0                 ;   // clear the overflow flag
     PIR1bits.SSP1IF = 0         ;   //  if a previous error, clear MSSP1 flag 
     err_flg = 0x00              ;   //  clear error variable 
        LATD = 0x00              ;   //  clear error message  
     SSP1CON2bits.ACKSTAT = 0    ;   //  recover slave's error (NOACK --> ACK)  
                                     //  ini_i2c1() will come in 'display_time()        
     display_time()          ;   }   // display on LCD all 6 time variables   
//************************************************************************************
//                                MAIN FUNCTION 
//¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     #pragma code    
     void main(void)                  //  sets the time/date variables, using the 2 
                                      //  onboard keys (S1=MENU, S2 = INCREMENT)  
 {  ini_gpio_led()               ;    //  PORTD     init (for LEDs) 
    ini_gpio_other()             ;    //  PORT A,B  init (onboard switches,NCS_SPI,MFP)
    ini_tim0()                   ;    //  init Timer0 (counting apps based on MFP) 
    ini_tim1()                   ;    //  init Timer1 (used for LCD & I2C delays in the INTR) 
    ini_tim3()                   ;    //  init Timer3 (used for delays in the MAIN FUNCTION)
    OSCTUNEbits.PLLEN = 1        ;    //  enable PLL 
//...........................................................................................
    ini_spi1()                   ;    //  init the SPI1 module for LCD
    ini_spidemux()               ;    //  init the SPI demux chip 
    ini_lcd()                    ;    //  init the LCD module (for further messages)
    wrcmnd_lcd(DISPLAY+D_ON)     ;    //  shut down CURSOR & BLINK (keep the display)  
    wrstr_lcd(date)              ;    //  write in LCD : "date 20" 
    wrcmnd_lcd(SET_DDRAM+N2_ROW2);    //  set cursor on the second row 
    wrstr_lcd(tim)               ;    //  write in LCD : "time" 
//.......................................................................................
     stop_mssp1()                ;    //  prepare to switch MSSP1 to I2C 
     ini_i2c1()                  ;    //  initialize the I2C1 module 
     ini_rtcc()                  ;    //  initialize MCP79410(enable VBAT). 
     ini_time()                  ;    //  at first startup, init time/date vars
                                      //  & related registers in RTCC 
                                      //  2010_03_01 , 9 am, etc. 
                                      //  it initializes also : 12H format and start OSC  
//.......................................................................................  
     TMR0H = 0xff ; TMR0L = 0xff  ;   //  init counter values for 1 step/sec                    
     T0_ON = 1                    ;   //  start counter 
     ini_intr()                   ;   //  init   TMR0 interrupts 
     start_intr()                 ;   //  enable TMRO interrupts        
     while(1) {                       //  infinite loop       
  while(keyb_press()==KEYB_INCR)  ;   //  wait Interrupts, till the MENU_KEY is pressed
  stop_intr()                     ;   //  disable interrupts after entering the setup menu 
  wrcmnd_lcd(DISPLAY+D_ON+C_ON+B_ON); //  start cursor & blink 
  wrcmnd_lcd(SET_DDRAM+N2_ROW1+07);   //  set LCD_addr for YEAR 

  while(keyb_press()==KEYB_INCR)      //  at every action of INCR KEY,
  { incr_yr()  ;  }                   //  year++ , exit only when MENU KEY = ON
  wrcmnd_lcd(SET_DDRAM+N2_ROW1+10);   //  set LCD_addr for MONTH
   
  while(keyb_press()==KEYB_INCR)      //  at every action of INCR KEY,
  { incr_mon() ;  }                   //  month++ , exit only when MENU KEY = ON
  wrcmnd_lcd(SET_DDRAM+N2_ROW1+13);   //  set LCD_addr for DATE 
 
  while(keyb_press()==KEYB_INCR)      //  at every action of INCR KEY,
  { incr_dat() ;  }                   //  date++ , exit only when MENU KEY = ON
  wrcmnd_lcd(SET_DDRAM+N2_ROW2+07);   //  set LCD_addr for HOUR
 
  while(keyb_press()==KEYB_INCR)      //  at every action of INCR KEY,
  { incr_hr()  ;  }                   //  hour++ , exit only when MENU KEY = ON
  wrcmnd_lcd(SET_DDRAM+N2_ROW2+10);   //  set LCD_addr for MINUTES

  while(keyb_press()==KEYB_INCR)      //  at every action of INCR KEY,
  { incr_min() ;  }                   //  minutes++ , exit only when MENU KEY = ON
  wrcmnd_lcd(SET_DDRAM+N2_ROW2+13);   //  set LCD_addr for SECONDS 

  while(keyb_press()==KEYB_INCR)      //  at every action of INCR KEY,
  { incr_sec() ;  }                   //  seconds++ , exit only when MENU KEY = ON
                                      //  once the SETUP MENU is exit
  wrcmnd_lcd(DISPLAY+D_ON)        ;   //  stop cursor & blink 

  stop_mssp1() ; ini_i2c1()       ;   //  switch again to I2C, SSP1CON2=0x00  
  PIR1bits.SSP1IF = 0             ;   //  if a previous error, clear MSSP1 flag 
  err_flg = 0x00                  ;   //  clear error variable
  SSP1CON2bits.ACKSTAT = 0        ;   //  recover slave's error (NOACK --> ACK)
  LATD = 0x00                     ;   //  clear LEDs (if previous error messages)    
  rtcc_wr(yr,ADDR_YEAR)           ;   //  update YEAR    value in RTCC
  rtcc_wr(mon,ADDR_MNTH)          ;   //  update MONTH   value in RTCC
                                      //  LP bit is read only; you may clear it. 
  rtcc_wr(dat,ADDR_DATE)          ;   //  update DATE    value in RTCC
  rtcc_wr(hr,ADDR_HOUR)           ;   //  update HOUR    value in RTCC                
  rtcc_wr(min,ADDR_MIN)           ;   //  update MINUTES value in RTCC
  sec = sec | START_32KHZ         ;   //  restore oscillator START bit
  rtcc_wr(sec,ADDR_SEC)           ;   //  update SECONDS value in RTCC   
  dly100ms()    ;   dly100ms()    ;   //  short delay to avoid keyboard hazard 
  start_intr()                    ;   //  enable again interrupts       
                                  }   //  end of WHILE(1) loop, wait interrupts      
//.......................................................................................        
                                 }    //  END MAIN 
    